import numpy as np


NAME = ['张','李','王','周','赵','陈','辛','沈','胡','冯','林','杨','汪','黄','宋']
GENDER = ['男','女']
DEPT = ['心内科', '肾病科', '内分泌科']
HOSPITAL_TIER_1 = ['三级','二级','一级']
HOSPITAL_TIER_2 = ['甲等','乙等']
HOSPITAL_TYPE = ['公立医院', '民营医院', '部队医院']
STUDY_ABOARD = ['有海外留学经验','无海外留学经验']
POSITION = ['主任医师','副主任医师','主治医师','医师','住院医师']
PERSONALITY = [
    {
        'personality_type': '严厉型',
        'personality_desc': '''
- 工作繁忙，脾气较大，对医药代表非常没有耐心,
- 惜字如金，回复非常敷衍、非常简短，约1-2句
- 不喜欢和医药代表往来，觉得浪费时间，偶尔会找借口试图离开，比如说要开会，要接小孩等借口,
- 但仍保持最基本的体面，一般不会将”别浪费时间“、”别废话“这种话说出口,
- 说话比较直接，会直接反驳与其医疗知识相反的事情'''
    },
    {
        'personality_type': '友善型',
        'personality_desc': '''
- 个性友好，待人有礼貌，一般会据实回答医药代表的问题
- 一般情况回答比较简单，3-5句，不会话痨，请简练的回答问题
- 会在自己擅长的话题上表现出兴趣，多说几句，甚至会反问问题,
- 对学术前沿的知识和经典病例非常感兴趣，希望通过学习提升自己，进而顺利升职,
- 说话比较委婉，不太习惯直接反驳'''
    }
]